modm-ext/data.modm.io/docs/svd/header_stm32h753xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FMC_Bank3_R</name>
      <description>Flexible Memory Controller Bank3</description>
      <groupName>FMC_Bank3</groupName>
      <baseAddress>0x52004080</baseAddress>
      <registers>
        <register>
          <name>PCR</name>
          <description>NAND Flash control register 3</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PWAITEN</name>
              <description>Wait feature enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PBKEN</name>
              <description>NAND Flash memory bank enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWID</name>
              <description>PWID[1:0] bits (NAND Flash databus width)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ECCEN</name>
              <description>ECC computation logic enable bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCLR</name>
              <description>TCLR[3:0] bits (CLE to RE delay)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TAR</name>
              <description>TAR[3:0] bits (ALE to RE delay)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ECCPS</name>
              <description>ECCPS[1:0] bits (ECC page size)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>NAND Flash FIFO status and interrupt register 3</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IRS</name>
              <description>Interrupt Rising Edge status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ILS</name>
              <description>Interrupt Level status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFS</name>
              <description>Interrupt Falling Edge status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IREN</name>
              <description>Interrupt Rising Edge detection Enable bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ILEN</name>
              <description>Interrupt Level detection Enable bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFEN</name>
              <description>Interrupt Falling Edge detection Enable bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FEMPT</name>
              <description>FIFO empty</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMEM</name>
          <description>NAND Flash Common memory space timing register 3</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MEMSET</name>
              <description>MEMSET[7:0] bits (Common memory setup time)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MEMWAIT</name>
              <description>MEMWAIT[7:0] bits (Common memory wait time)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MEMHOLD</name>
              <description>MEMHOLD[7:0] bits (Common memory hold time)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MEMHIZ</name>
              <description>MEMHIZ[7:0] bits (Common memory databus HiZ time)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PATT</name>
          <description>NAND Flash Attribute memory space timing register 3</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ATTSET</name>
              <description>ATTSET[7:0] bits (Attribute memory setup time)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ATTWAIT</name>
              <description>ATTWAIT[7:0] bits (Attribute memory wait time)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ATTHOLD</name>
              <description>ATTHOLD[7:0] bits (Attribute memory hold time)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ATTHIZ</name>
              <description>ATTHIZ[7:0] bits (Attribute memory databus HiZ time)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCR</name>
          <description>NAND Flash ECC result registers 3</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
