modm-ext/data.modm.io/docs/svd/header_stm32h753xx.svd
        <register>
          <name>CFGR</name>
          <description>RCC clock configuration register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SW</name>
              <description>SW[2:0] bits (System clock Switch)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWS</name>
              <description>SWS[2:0] bits (System Clock Switch Status)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI used as system clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <description>CSI used as system clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE used as system clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1</name>
                  <description>PLL1 used as system clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPWUCK</name>
              <description>Wake Up from stop and CSS backup clock selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPKERWUCK</name>
              <description>Kernel Clock Selection after a Wake Up from STOP</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCPRE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCLOCK</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_2</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_3</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_4</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_5</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_6</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_7</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_8</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_9</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_10</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_11</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_12</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_13</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_14</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_15</name>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_16</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_17</name>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_18</name>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_19</name>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_20</name>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_21</name>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_22</name>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_23</name>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_24</name>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_25</name>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_26</name>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_27</name>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_28</name>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_29</name>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_30</name>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_31</name>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_32</name>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_33</name>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_34</name>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_35</name>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_36</name>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_37</name>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_38</name>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_39</name>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_40</name>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_41</name>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_42</name>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_43</name>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_44</name>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_45</name>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_46</name>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_47</name>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_48</name>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_49</name>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_50</name>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_51</name>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_52</name>
                  <value>52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_53</name>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_54</name>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_55</name>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_56</name>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_57</name>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_58</name>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_59</name>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_60</name>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_61</name>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_62</name>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DIV_63</name>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HRTIMSEL</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIM</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMPRE</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWICE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR_TIMES</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCO1PRE</name>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MCO1</name>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MCO2PRE</name>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MCO2</name>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>D1CFGR</name>
          <description>RCC Domain 1 configuration register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HPRE</name>
              <description>HPRE[3:0] bits (AHB3 prescaler)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>D1PPRE</name>
              <description>D1PRE[2:0] bits (APB3 prescaler)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>D1CPRE</name>
              <description>D1CPRE[2:0] bits (Domain 1 Core prescaler)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>D2CFGR</name>
          <description>RCC Domain 2 configuration register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>D2PPRE1</name>
              <description>D1PPRE1[2:0] bits (APB1 prescaler)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>D2PPRE2</name>
              <description>D2PPRE2[2:0] bits (APB2 prescaler)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>D3CFGR</name>
          <description>RCC Domain 3 configuration register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>D3PPRE</name>
              <description>D3PPRE1[2:0] bits (APB4 prescaler)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCKSELR</name>
          <description>RCC PLLs Clock Source Selection Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLLSRC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVM1</name>
              <bitOffset>4</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DIVM2</name>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DIVM3</name>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCFGR</name>
          <description>RCC PLLs Configuration Register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLL1FRACEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1VCOSEL</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1RGE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PLL2FRACEN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2VCOSEL</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2RGE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PLL3FRACEN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3VCOSEL</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3RGE</name>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DIVP1EN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIVQ1EN</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIVR1EN</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIVP2EN</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIVQ2EN</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIVR2EN</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIVP3EN</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIVQ3EN</name>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIVR3EN</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1DIVR</name>
          <description>RCC PLL1 Dividers Configuration Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>N1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>P1</name>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>Q1</name>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>R1</name>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1FRACR</name>
          <description>RCC PLL1 Fractional Divider Configuration Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FRACN1</name>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL2DIVR</name>
          <description>RCC PLL2 Dividers Configuration Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>N2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>P2</name>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>Q2</name>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>R2</name>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
